MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX370F512L.atdf
         <register caption="" name="TRISA" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISA" />
            <bitfield mask="0x00000002" name="TRISA" />
            <bitfield mask="0x00000004" name="TRISA" />
            <bitfield mask="0x00000008" name="TRISA" />
            <bitfield mask="0x00000010" name="TRISA" />
            <bitfield mask="0x00000020" name="TRISA" />
            <bitfield mask="0x00000040" name="TRISA" />
            <bitfield mask="0x00000080" name="TRISA" />
            <bitfield mask="0x00000100" name="TRISA" />
            <bitfield mask="0x00000200" name="TRISA" />
            <bitfield mask="0x00000400" name="TRISA" />
            <bitfield mask="0x00000800" name="TRISA" />
            <bitfield mask="0x00001000" name="TRISA" />
            <bitfield mask="0x00002000" name="TRISA" />
            <bitfield mask="0x00004000" name="TRISA" />
            <bitfield mask="0x00008000" name="TRISA" />
         </register>
         <register caption="" name="TRISB" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISB" />
            <bitfield mask="0x00000002" name="TRISB" />
            <bitfield mask="0x00000004" name="TRISB" />
            <bitfield mask="0x00000008" name="TRISB" />
            <bitfield mask="0x00000010" name="TRISB" />
            <bitfield mask="0x00000020" name="TRISB" />
            <bitfield mask="0x00000040" name="TRISB" />
            <bitfield mask="0x00000080" name="TRISB" />
            <bitfield mask="0x00000100" name="TRISB" />
            <bitfield mask="0x00000200" name="TRISB" />
            <bitfield mask="0x00000400" name="TRISB" />
            <bitfield mask="0x00000800" name="TRISB" />
            <bitfield mask="0x00001000" name="TRISB" />
            <bitfield mask="0x00002000" name="TRISB" />
            <bitfield mask="0x00004000" name="TRISB" />
            <bitfield mask="0x00008000" name="TRISB" />
         </register>
         <register caption="" name="TRISC" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISC" />
            <bitfield mask="0x00000002" name="TRISC" />
            <bitfield mask="0x00000004" name="TRISC" />
            <bitfield mask="0x00000008" name="TRISC" />
            <bitfield mask="0x00000010" name="TRISC" />
            <bitfield mask="0x00000020" name="TRISC" />
            <bitfield mask="0x00000040" name="TRISC" />
            <bitfield mask="0x00000080" name="TRISC" />
            <bitfield mask="0x00000100" name="TRISC" />
            <bitfield mask="0x00000200" name="TRISC" />
            <bitfield mask="0x00000400" name="TRISC" />
            <bitfield mask="0x00000800" name="TRISC" />
            <bitfield mask="0x00001000" name="TRISC" />
            <bitfield mask="0x00002000" name="TRISC" />
            <bitfield mask="0x00004000" name="TRISC" />
            <bitfield mask="0x00008000" name="TRISC" />
         </register>
         <register caption="" name="TRISD" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISD" />
            <bitfield mask="0x00000002" name="TRISD" />
            <bitfield mask="0x00000004" name="TRISD" />
            <bitfield mask="0x00000008" name="TRISD" />
            <bitfield mask="0x00000010" name="TRISD" />
            <bitfield mask="0x00000020" name="TRISD" />
            <bitfield mask="0x00000040" name="TRISD" />
            <bitfield mask="0x00000080" name="TRISD" />
            <bitfield mask="0x00000100" name="TRISD" />
            <bitfield mask="0x00000200" name="TRISD" />
            <bitfield mask="0x00000400" name="TRISD" />
            <bitfield mask="0x00000800" name="TRISD" />
            <bitfield mask="0x00001000" name="TRISD" />
            <bitfield mask="0x00002000" name="TRISD" />
            <bitfield mask="0x00004000" name="TRISD" />
            <bitfield mask="0x00008000" name="TRISD" />
         </register>
         <register caption="" name="TRISE" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISE" />
            <bitfield mask="0x00000002" name="TRISE" />
            <bitfield mask="0x00000004" name="TRISE" />
            <bitfield mask="0x00000008" name="TRISE" />
            <bitfield mask="0x00000010" name="TRISE" />
            <bitfield mask="0x00000020" name="TRISE" />
            <bitfield mask="0x00000040" name="TRISE" />
            <bitfield mask="0x00000080" name="TRISE" />
            <bitfield mask="0x00000100" name="TRISE" />
            <bitfield mask="0x00000200" name="TRISE" />
            <bitfield mask="0x00000400" name="TRISE" />
            <bitfield mask="0x00000800" name="TRISE" />
            <bitfield mask="0x00001000" name="TRISE" />
            <bitfield mask="0x00002000" name="TRISE" />
            <bitfield mask="0x00004000" name="TRISE" />
            <bitfield mask="0x00008000" name="TRISE" />
         </register>
         <register caption="" name="TRISF" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISF" />
            <bitfield mask="0x00000002" name="TRISF" />
            <bitfield mask="0x00000004" name="TRISF" />
            <bitfield mask="0x00000008" name="TRISF" />
            <bitfield mask="0x00000010" name="TRISF" />
            <bitfield mask="0x00000020" name="TRISF" />
            <bitfield mask="0x00000040" name="TRISF" />
            <bitfield mask="0x00000080" name="TRISF" />
            <bitfield mask="0x00000100" name="TRISF" />
            <bitfield mask="0x00000200" name="TRISF" />
            <bitfield mask="0x00000400" name="TRISF" />
            <bitfield mask="0x00000800" name="TRISF" />
            <bitfield mask="0x00001000" name="TRISF" />
            <bitfield mask="0x00002000" name="TRISF" />
            <bitfield mask="0x00004000" name="TRISF" />
            <bitfield mask="0x00008000" name="TRISF" />
         </register>
         <register caption="" name="TRISG" offset="0x610" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISG" />
            <bitfield mask="0x00000002" name="TRISG" />
            <bitfield mask="0x00000004" name="TRISG" />
            <bitfield mask="0x00000008" name="TRISG" />
            <bitfield mask="0x00000010" name="TRISG" />
            <bitfield mask="0x00000020" name="TRISG" />
            <bitfield mask="0x00000040" name="TRISG" />
            <bitfield mask="0x00000080" name="TRISG" />
            <bitfield mask="0x00000100" name="TRISG" />
            <bitfield mask="0x00000200" name="TRISG" />
            <bitfield mask="0x00000400" name="TRISG" />
            <bitfield mask="0x00000800" name="TRISG" />
            <bitfield mask="0x00001000" name="TRISG" />
            <bitfield mask="0x00002000" name="TRISG" />
            <bitfield mask="0x00004000" name="TRISG" />
            <bitfield mask="0x00008000" name="TRISG" />
         </register>
